# Практическое задание 35.4

## Задания

### Описание задачи
В предыдущих блоках ты научился создавать функции, передавать аргументы разными способами и работать с переменным количеством параметров. Теперь важно закрепить понимание **области видимости переменных** — границ, в которых переменная доступна. В этом блоке ты будешь работать с локальными и глобальными переменными, явным указанием `global` и идеей замыкания. Это поможет избежать ошибок, когда переменная "не видна" или изменяется не там, где ожидалось.

Твоя задача — написать программу, которая моделирует простой банковский счет с операциями пополнения и снятия, используя разные подходы к управлению состоянием счета. Это подведет тебя к пониманию, как данные "живут" внутри и вне функций.

### Пример входных и выходных данных
**Пример 1: Использование глобальной переменной**
```python
# Исходный код
balance = 1000  # начальный баланс

def deposit(amount):
    global balance
    balance += amount
    return balance

def withdraw(amount):
    global balance
    if amount <= balance:
        balance -= amount
        return balance
    else:
        return "Недостаточно средств"

print(deposit(500))   # Ожидаемый вывод: 1500
print(withdraw(200))  # Ожидаемый вывод: 1300
print(balance)        # Ожидаемый вывод: 1300
print(withdraw(2000)) # Ожидаемый вывод: Недостаточно средств
```

**Пример 2: Использование замыкания (функция, возвращающая функцию)**
```python
# Исходный код
def create_account(initial_balance):
    balance = initial_balance  # локальная переменная внешней функции

    def deposit(amount):
        nonlocal balance  # указываем, что balance — не локальная, а из внешней области
        balance += amount
        return balance

    def withdraw(amount):
        nonlocal balance
        if amount <= balance:
            balance -= amount
            return balance
        else:
            return "Недостаточно средств"

    return deposit, withdraw  # возвращаем обе функции

deposit, withdraw = create_account(1000)
print(deposit(500))   # Ожидаемый вывод: 1500
print(withdraw(200))  # Ожидаемый вывод: 1300
# print(balance)      # Ошибка! balance здесь не определена — она локальная для create_account
```

### Критерии проверки и ограничения
1.  **Обязательно используй только пройденные темы:** область видимости, локальная переменная, глобальная переменная, `global`, замыкание. Не используй классы, декораторы или другие непройденные концепции.
2.  Реализуй две версии программы:
    *   **Версия А:** Управление счетом через глобальную переменную `balance`. Функции `deposit` и `withdraw` должны изменять эту глобальную переменную.
    *   **Версия Б:** Управление счетом через замыкание. Функция `create_account` принимает начальный баланс и возвращает две функции для операций. Состояние счета (`balance`) должно быть защищено внутри замыкания.
3.  Функция `withdraw` должна проверять, достаточно ли средств на счете.
4.  Каждая функция должна возвращать актуальный баланс после операции или строку "Недостаточно средств".
5.  В основной части программы продемонстрируй работу обеих версий с одинаковой последовательностью операций (например, пополнение на 500, снятие 200, попытка снять 2000).

### Решение задачи (псевдокод)
**Для Версии А (глобальная переменная):**
1.  Объяви глобальную переменную `balance` и присвой ей начальное значение.
2.  Создай функцию `deposit`, которая принимает сумму `amount`.
    *   Объяви, что внутри функции используется глобальная переменная `balance`.
    *   Увеличь `balance` на `amount`.
    *   Верни новое значение `balance`.
3.  Создай функцию `withdraw`, которая принимает сумму `amount`.
    *   Объяви, что внутри функции используется глобальная переменная `balance`.
    *   Если `amount` меньше или равен `balance`:
        *   Уменьши `balance` на `amount`.
        *   Верни новое значение `balance`.
    *   Иначе:
        *   Верни строку "Недостаточно средств".
4.  В основном коде вызови функции с тестовыми значениями и выведи результаты.

**Для Версии Б (замыкание):**
1.  Создай функцию `create_account`, которая принимает `initial_balance`.
    *   Внутри функции объяви локальную переменную `balance` и присвой ей значение `initial_balance`.
    *   Создай вложенную функцию `deposit`, которая принимает `amount`.
        *   Укажи, что переменная `balance` берется из внешней (но не глобальной) области видимости.
        *   Увеличь `balance` на `amount`.
        *   Верни новое значение `balance`.
    *   Создай вложенную функцию `withdraw`, которая принимает `amount`.
        *   Укажи, что переменная `balance` берется из внешней области видимости.
        *   Если `amount` меньше или равен `balance`:
            *   Уменьши `balance` на `amount`.
            *   Верни новое значение `balance`.
        *   Иначе:
            *   Верни строку "Недостаточно средств".
    *   Верни из `create_account` обе вложенные функции (`deposit` и `withdraw`).
2.  В основном коде вызови `create_account` с начальным балансом, чтобы получить функции для операций.
3.  Используй полученные функции для проведения тех же операций, что и в Версии А.

### Рекомендации
-   **Вынести в отдельную функцию:** В данном задании основная логика уже инкапсулирована в функции. Для чистоты кода можно вынести демонстрационный пример (последовательность вызовов `deposit` и `withdraw`) в отдельную функцию, например, `run_demo(balance, operations)`, но это не является обязательным требованием.
-   **PEP8:**
    *   Используй осмысленные имена переменных и функций (`balance`, `deposit`, `withdraw` вместо `b`, `d`, `w`).
    *   После объявления функции оставляй две пустые строки перед следующим блоком кода. Внутри функции отделяй логические блоки одной пустой строкой (например, условие `if`).
