# Задача 57.1: Логирование регистрации пользователя

## Описание задачи

Написать программу для логирования события — создания нового пользователя в системе.

## Требования

Программа должна:

- Записывать в лог сообщение о создании пользователя (с уровнем **INFO**)
- Записывать в лог ошибку, если имя пользователя не было предоставлено (с уровнем **ERROR**)
- Логировать время события в формате `YYYY-MM-DD HH:MM:SS`
- Вычислить, через сколько дней пользователь сможет снова зарегистрироваться, если учётная запись активна 7 дней
- Вернуть дату, указывающую, через сколько дней пройдёт повторная регистрация

## Функция для реализации

Необходимо реализовать функцию, которая принимает на вход имя пользователя:

- Реализовать логику регистрации пользователя и обработку ошибок при некорректном имени (должно состоять только из букв)
- Реализовать вычисление даты для следующей регистрации, которую функция должна вернуть

## Указания

Настройте логгер с двумя уровнями:

- **INFO** для успешной регистрации
- **ERROR** для ошибок (например, если имя пользователя не было передано)

Реализуйте одну функцию, которая:

- Принимает имя пользователя
- Логирует успешную регистрацию, если имя предоставлено корректно
- Логирует ошибку, если имя не передано
- Возвращает дату, указывающую, когда пользователь может зарегистрироваться снова (через 7 дней)

## Пример входных данных

### Ввод:

```python
# Пример успешной регистрации
register_user("Ivan")

# Пример ошибки
register_user("")
```

### Вывод:

**В файле лога:**
```
2025-01-08 14:30:45 - INFO - Пользователь Ivan успешно зарегистрирован.
2025-01-08 14:35:12 - ERROR - Ошибка: Имя пользователя не предоставлено.
```

**На экране:**
```
Дата повторной регистрации: 2025-01-15
```

---

## 💡 Пример реализации (псевдокод)

```
# Настройка системы логирования
СОЗДАТЬ_ЛОГГЕР("логгер_регистрации")
УСТАНОВИТЬ_УРОВЕНЬ_ЛОГГИРОВАНИЯ(ИНФОРМАЦИЯ)

СОЗДАТЬ_ОБРАБОТЧИК_ФАЙЛА("лог_регистрации.txt")
УСТАНОВИТЬ_ФОРМАТ("ВРЕМЯ - УРОВЕНЬ - СООБЩЕНИЕ")

# Функция регистрации пользователя
ФУНКЦИЯ зарегистрировать_пользователя(имя_пользователя):
    ПОПЫТАТЬСЯ:
        ЕСЛИ имя_пользователя СОСТОИТ_ТОЛЬКО_ИЗ_БУКВ:
            # Записываем успешную регистрацию в лог
            ЗАПИСАТЬ_В_ЛОГ_ИНФО("Пользователь " + имя_пользователя + " успешно зарегистрирован.")
        ИНАЧЕ:
            # Генерируем ошибку, если имя некорректное
            СГЕНЕРИРОВАТЬ_ОШИБКУ("Имя пользователя не предоставлено или некорректно.")
            
    ИСКЛЮЧЕНИЕ КАК ошибка:
        ЗАПИСАТЬ_В_ЛОГ_ОШИБКИ("Ошибка: " + ошибка)

    # Вычисляем дату следующей регистрации (текущая дата + 7 дней)
    следующая_дата = ТЕКУЩАЯ_ДАТА + ПРИБАВИТЬ_ДНИ(7)

    ВОЗВРАТИТЬ следующая_дата

# Пример использования функции
ВЫВЕСТИ "Дата повторной регистрации: " + ФОРМАТ_ДАТЫ(зарегистрировать_пользователя("Ivan"))
ВЫВЕСТИ "Дата повторной регистрации: " + ФОРМАТ_ДАТЫ(зарегистрировать_пользователя(""))
```

---

## 🔍 Детальный разбор задачи

### Шаг 1: Понимание системы логирования
Логирование — это запись событий, происходящих в программе, в файл или консоль. Каждый лог имеет уровень важности (INFO, ERROR, WARNING и т.д.) и временную метку.

### Шаг 2: Структура программы
1. **Настройка логгера** — создание объекта для записи логов
2. **Обработчик файла** — указание, куда сохранять логи
3. **Форматирование** — определение вида каждой записи в логе
4. **Функция регистрации** — основная логика с обработкой ошибок
5. **Работа с датами** — вычисление даты следующей регистрации

### Шаг 3: Конвертация в реальный код

| Псевдокод | Python эквивалент | Объяснение |
|-----------|-------------------|------------|
| `СОЗДАТЬ_ЛОГГЕР` | `logging.getLogger()` | Создает логгер с указанным именем |
| `УСТАНОВИТЬ_УРОВЕНЬ_ЛОГГИРОВАНИЯ` | `logger.setLevel()` | Устанавливает минимальный уровень логирования |
| `СОЗДАТЬ_ОБРАБОТЧИК_ФАЙЛА` | `logging.FileHandler()` | Создает обработчик для записи в файл |
| `УСТАНОВИТЬ_ФОРМАТ` | `logging.Formatter()` | Определяет формат сообщений |
| `ЗАПИСАТЬ_В_ЛОГ_ИНФО` | `logger.info()` | Записывает информационное сообщение |
| `ЗАПИСАТЬ_В_ЛОГ_ОШИБКИ` | `logger.error()` | Записывает сообщение об ошибке |
| `ТЕКУЩАЯ_ДАТА` | `datetime.now()` | Возвращает текущую дату и время |
| `ПРИБАВИТЬ_ДНИ` | `timedelta(days=n)` | Добавляет указанное количество дней |
| `ФОРМАТ_ДАТЫ` | `strftime('%Y-%m-%d')` | Форматирует дату в нужный вид |

### Шаг 4: Ключевые концепции

1. **Logging Levels (Уровни логирования)**:
   - `DEBUG` — детальная информация для отладки
   - `INFO` — информационные сообщения о работе программы
   - `WARNING` — предупреждения о потенциальных проблемах
   - `ERROR` — сообщения об ошибках, которые не останавливают программу
   - `CRITICAL` — критические ошибки, которые могут привести к падению программы

2. **Components of Logging (Компоненты логирования)**:
   - **Logger** — основной объект для создания логов
   - **Handler** — определяет, куда отправлять логи (файл, консоль, сеть)
   - **Formatter** — форматирует сообщения перед записью
   - **Filter** — фильтрует сообщения по критериям

3. **Date Operations (Работа с датами)**:
   - `datetime.now()` — получение текущего момента
   - `timedelta()` — интервал времени (дни, часы, минуты)
   - Арифметика дат — сложение и вычитание дат

### Шаг 5: Порядок выполнения программы

1. **Инициализация логгера**:
   - Создается логгер с уникальным именем
   - Устанавливается уровень логирования (INFO и выше)
   - Создается файловый обработчик
   - Устанавливается формат времени + уровень + сообщение

2. **Вызов функции регистрации**:
   - Принимается имя пользователя
   - Проверяется, состоит ли имя только из букв
   - При успехе — записывается INFO в лог
   - При ошибке — генерируется исключение и записывается ERROR

3. **Вычисление даты**:
   - Берется текущая дата
   - Добавляется 7 дней
   - Возвращается результат

4. **Вывод результата**:
   - Дата форматируется в формат ГГГГ-ММ-ДД
   - Выводится на экран

### Шаг 6: Обработка ошибок

Программа использует конструкцию `try-except` для перехвата ошибок:
- Если имя пользователя пустое или содержит не только буквы — генерируется ValueError
- Ошибка ловится в блоке except и записывается в лог
- Программа продолжает выполнение и все равно возвращает дату

---

## 📝 Как конвертировать этот псевдокод в реальную программу:

1. **Импорт необходимых модулей**:
   ```python
   import logging
   from datetime import datetime, timedelta
   ```

2. **Настройка логгера**:
   - Создайте логгер: `logger = logging.getLogger('registration_logger')`
   - Установите уровень: `logger.setLevel(logging.INFO)`
   - Создайте обработчик файла: `file_handler = logging.FileHandler('registration_log.txt')`
   - Установите формат: `formatter = logging.Formatter('%(asctime)s - %(levelname)s - %(message)s')`

3. **Реализация функции**:
   - Используйте `def register_user(username: str):` для определения функции
   - Проверьте имя: `if username.isalpha():`
   - Используйте `logger.info()` и `logger.error()` для записи логов
   - Вычислите дату: `datetime.now() + timedelta(days=7)`

4. **Обработка ошибок**:
   - Используйте `try-except` блок для перехвата исключений
   - Генерируйте ошибку: `raise ValueError("Сообщение об ошибке")`

5. **Форматирование вывода**:
   - Используйте `strftime('%Y-%m-%d')` для форматирования даты
   - Выводите через `print()` с f-строками

---